[
  {
    "_class": "com.bhtcnpm.website.model.entity.ExerciseEntities.ExerciseSubject",
    "id": 1,
    "name": "Cấu trúc rời rạc",
    "description": "Cấu trúc rời rạc là môn học ở giai đoạn kiến thức đại cương, là môn học bắt buộc đối với tất cả sinh viên. Đây là một trong những môn thi tuyển sinh đầu vào ở bậc Sau đại học ngành công nghệ thông tin. Môn học này giúp cho sinh viên có kiến thức, có kỹ năng giải quyết được những bài toán liên quan đến Toán rời rạc (cơ sở logic, các phương pháp đếm, quan hệ, đại số Bool và hàm Bool), và Lý thuyết đồ thị (các khái niệm cơ bản về lý thuyết đồ thị, đường đi, chu trình và cây).",
    "imageURL": "https://i.imgur.com/L1oG5Q1.png",
    "subjectGroup": {
      "id": 1
    },
    "subjectFaculty": {
      "id": 7
    },
    "version": 0
  },
  {
    "_class": "com.bhtcnpm.website.model.entity.ExerciseEntities.ExerciseSubject",
    "id": 2,
    "name": "Đại số tuyến tính",
    "description": "Đại số tuyến tính là môn học ở giai đoạn kiến thức đại cương, là môn học bắt buộc đối với tất cả sinh viên. Môn học này giúp cho sinh viên nắm được khái niệm và làm được các phép toán về: ma trận, hạng, định thức, hệ phương trình tuyến tính; cách giải hệ phương trình tuyến tính bằng phương pháp Cramer, phương pháp Gauss, phương pháp Gauss-Jordan; về không gian vector, sự phụ thuộc, độc lập tuyến tính, tập sinh, cơ sở và số chiều của không gian vector; ma trận chéo hóa và ý nghĩa của việc chéo hóa ma trận; về ánh xạ tuyến tính, toán tử tuyến tính, dạng toàn phương và phép đưa dạng toàn phương về dạng chính tắc; để từ đó SV có thể tiếp tục học tập những môn chuyên ngành, hay phục vụ cho quá trình làm khóa luận tốt nghiệp.",
    "imageURL": "https://i.imgur.com/MHZtgoN.png",
    "subjectGroup": {
      "id": 1
    },
    "subjectFaculty": {
      "id": 7
    },
    "version": 0
  },
  {
    "_class": "com.bhtcnpm.website.model.entity.ExerciseEntities.ExerciseSubject",
    "id": 3,
    "name": "Giải tích",
    "description": "Môn Giải tích là môn học ở giai đoạn kiến thức đại cương, là môn học bắt buộc đối với tất cả sinh viên. Môn học này giúp cho SV có kiến thức cơ bản về phép tính vi phân hàm nhiều biến; phép tính tích phân hàm nhiều biến (tích phân bội); tích phân đường, tích phân mặt; cũng như là kỹ năng khảo sát chuỗi số, chuỗi hàm, tích phân suy rộng,…cùng với việc nhận dạng và giải quyết một số phương trình vi phân cấp một, cấp cao,…để từ đó SV có thể tiếp tục học tập những môn chuyên ngành, hay phục vụ cho quá trình làm khóa luận tốt nghiệp.",
    "imageURL": "https://i.imgur.com/zXFBHpT.png",
    "subjectGroup": {
      "id": 1
    },
    "subjectFaculty": {
      "id": 7
    },
    "version": 0
  },
  {
    "_class": "com.bhtcnpm.website.model.entity.ExerciseEntities.ExerciseSubject",
    "id": 4,
    "name": "Kỹ năng nghề nghiệp",
    "description": "Môn học cung cấp các kiến thức về các kỹ năng hỗ trợ trong lĩnh vực CNTT. Các kỹ năng này gồm kỹ năng giao tiếp, kỹ năng làm việc nhóm, kỹ năng tư duy, kỹ năng quản lý thời gian và kỹ năng thuyết trình. Nội dung môn học hướng sinh viên tới việc tìm hiểu và thực hành các kỹ năng này. Sinh viên sẽ có những kiến thức và kỹ năng ở mức độ cơ bản để có thể đáp ứng các yêu cầu học tập và làm việc trong ngành CNTT.",
    "imageURL": "https://i.imgur.com/7cknlCq.png",
    "subjectGroup": {
      "id": 1
    },
    "subjectFaculty": {
      "id": 8
    },
    "version": 0
  },
  {
    "_class": "com.bhtcnpm.website.model.entity.ExerciseEntities.ExerciseSubject",
    "id": 5,
    "name": "Nhập môn lập trình",
    "description": "Môn học sẽ cung cấp các kiến thức nền tảng về máy tính, tư duy và các kỹ năng\ncăn bản lập trình cho tất cả sinh viên các ngành Công nghệ thông tin.",
    "imageURL": "https://i.imgur.com/QZpduA3.png",
    "subjectGroup": {
      "id": 1
    },
    "subjectFaculty": {
      "id": 5
    },
    "version": 0
  },
  {
    "_class": "com.bhtcnpm.website.model.entity.ExerciseEntities.ExerciseSubject",
    "id": 6,
    "name": "Nhập môn mạch số",
    "description": "Môn học sẽ cung cấp các kiến thức nền tảng về máy tính, tư duy và các kỹ năng\ncăn bản lập trình cho tất cả sinh viên các ngành Công nghệ thông tin.",
    "imageURL": "https://i.imgur.com/ps78az1.png",
    "subjectGroup": {
      "id": 1
    },
    "subjectFaculty": {
      "id": 3
    },
    "version": 0
  },
  {
    "_class": "com.bhtcnpm.website.model.entity.ExerciseEntities.ExerciseSubject",
    "id": 7,
    "name": "Nhập môn phát triển Game",
    "description": "Môn học giới thiệu cho Sinh viên những khái niệm, thông tin cơ bản trong ngành game và đi sâu vào kỹ thuật lập trình DirectX để xây dựng các game 2D đơn giản như Tetris, Battle City, Mario, Contras... Chương 1 giới thiệu tổng quan về ngành game. Chương 2 giới thiệu về kỹ thuật lập trình Windows dùng C++ và Windows SDK. Chương 3 giới thiệu kỹ thuật làm chuyển động và kỹ thuật lập trình DirectX cơ bản. Chương 4 cung cấp kỹ thuật làm việc với Sprite và xử lý thiết bị nhập. Chương 5 thảo luận về các kỹ thuật hỗ trợ khác như phép biến đổi, lập trình DirectSound, hiển thị chữ ... Chương 6 bàn luận về Game Engine và cách xây dựng một game engine đơn giản.",
    "imageURL": "https://i.imgur.com/2v6qhfm.png",
    "subjectGroup": {
      "id": 2
    },
    "subjectFaculty": {
      "id": 1
    },
    "version": 0
  },
  {
    "_class": "com.bhtcnpm.website.model.entity.ExerciseEntities.ExerciseSubject",
    "id": 8,
    "name": "Xác suất thống kê",
    "description": "Xác suất thống kê là môn học bắt buộc (hoặc tự chọn) của sinh viên một số ngành thuộc lĩnh vực công nghệ thông tin. Đây là một trong những môn thi tuyển sinh đầu vào ở bậc Sau đại học ngành Khoa học máy tính. Môn học này trình bày các khái niệm và phương pháp về: Lý thuyết xác suất (Không gian xác suất; Biến ngẫu nhiên; Hàm đăc trưng; Dãy các biến ngẫu nhiên; Các quy luật phân phối xác suất; Các định lý giới hạn phân phối xác suất) và Thống kê (Mẫu ngẫu nhiên; Ước lượng điểm và ước lượng khoảng; Kiểm định các giả thiết thống kê; Phân tích tương quan và hồi quy; Một số vấn đề về quá trình ngẫu nhiên). Ngoài ra, môn học này còn giới thiệu về cách thức nhận diện, phân tích và xử lý một vấn đề thực tế; xử lý các số liệu thống kê; để từ đó giúp cho người dùng đưa ra các suy luận phù hợp (nhằm hỗ trợ cho quá trình ra quyết định).",
    "imageURL": "https://i.imgur.com/s7oujyK.png",
    "subjectGroup": {
      "id": 1
    },
    "subjectFaculty": {
      "id": 7
    },
    "version": 0
  }
]